app/controllers/password_reset_controller.rb

  def create
    	user = User.find_by email: params[:password_reset][:email].downcase
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "examples@examples.com"]]

  def update
    if params[:user][:password].empty?
      flash.now[:danger] ="Password can't be blank"
      render 'edit'
    elsif @user.update_attributes!(user_params)
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$UgEeA9kT25ZzLbAffW.uCOqqbDN1MTSjGgezXkJbWwQMCs/OoANny"], ["updated_at", "2015-06-11 06:49:03.015053"], ["id", 226]]