app/controllers/users_controller.rb

  def index
    @users = User.paginate(page: params[:page], per_page: 5)
---
SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users"

  def show
    @user = User.find params[:id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]

  def edit
    @user = User.find params[:id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]

  def create
    @user = User.new(user_params)
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-06-08 07:28:57.135458"], ["updated_at", "2015-06-08 07:28:57.135458"]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$Qzp54TJ.54fGWd2xZSkxDufJoj9a35Nlj/EaAjMmaNYDv8p8sa6YO"], ["updated_at", "2015-06-09 08:23:55.957569"], ["id", 6]]